{"id": "5d6112ee-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6114b0-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Internet Explorer\\\\iedw.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Messenger\\\\msmsgs.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d611b86-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d611c30-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Windows NT\\\\[a-z]*.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Documents and Settings\\\\<USER>\\\\Local Settings\\\\Temporary Internet Files\\\\Content.IE5\\\\5P7MTB1L\\\\PIL-1.1.7.win32-py2.7[1].exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d611f14-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d611f8c-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Internet Explorer\\\\iedw.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Windows NT\\\\[a-z]*.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6121da-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d61223e-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Movie Maker\\\\moviemk.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\ga\\\\[A-Za-z]*.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d61248c-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6124fa-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Internet Explorer\\\\iedw.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Windows NT\\\\Accessories\\\\wordpad.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d612900-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d612964-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Windows NT\\\\[a-z]*.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Internet Explorer\\\\IEXPLORE.EXE\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d612b26-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d612b80-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\Speech\\\\sapisvr.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Outlook Express\\\\[a-z0-9]*.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d612e28-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d612e8c-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\Speech\\\\sapisvr.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Program Files\\\\Windows NT\\\\Accessories\\\\wordpad.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6131d4-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ipamor", "tags": [], "interval": "5m", "enabled": true, "description": "ipamor", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d613256-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"11\" && file.path:\"C:\\\\Program Files\\\\Windows NT\\\\Accessories\\\\wordpad.exe\" ) || ( event.code:\"11\" && file.path:\"C:\\\\Python27\\\\Lib\\\\site-packages\\\\win32\\\\pythonservice.exe\" ) || ( event.code:\"11\" && file.path:\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\DW\\\\DW[A-Z]*20.EXE\" ) || ( event.code:\"11\" && file.path:\"C:\\\\Program Files\\\\Windows NT\\\\[a-z]*.exe\" ) || ( event.code:\"1\" && process.executable:\"C:\\\\WINDOWS\\\\MSWDM.EXE\" && process.command_line:\"-e!C:\\\\WINDOWS\\\\dev3.tmp!C:\\\\44FBA707E5E734140207DA9FA51E83DA16B7456C9BFAE3648EB75E4A2967D1AA!\" ) || ( event.code:\"11\" && file.path:\"C:\\\\Program Files\\\\Messenger\\\\msmsgs.exe\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d61367a-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "delf", "tags": [], "interval": "5m", "enabled": true, "description": "delf", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6136fc-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"11\" && file.path:\"C:\\\\WINDOWS\\\\win32dc\\\\.{8,26}.exe\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d613b5c-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "gandcrab", "tags": [], "interval": "5m", "enabled": true, "description": "gandcrab", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d613c24-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"13\" && registry.path:\"HKEY_USERS\\\\S-1-5-18\\\\Software\\\\Microsoft\\\\windows\\\\CurrentVersion\\\\Internet Settings\\\\ProxyEnable\" && registry.value:\"ProxyEnable\" && winlog.event_data.RegDetails:\"0\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6140f2-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "urelas", "tags": [], "interval": "5m", "enabled": true, "description": "urelas", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d614282-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[registry where event.code == \"13\" and registry.path==\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\ESENT\\\\Process\\\\[a-z]{5,7}\\\\DEBUG\\\\.*\" and registry.value==\".*\" and winlog.event_data.RegDetails==\"[0-9]{0,2}\"] by winlog.event_data.TopProcessGuid\r\n[registry where event.code == \"13\" and registry.path==\"HKEY_LOCAL_MACHINE\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\FileAssociation\\\\C:\\\\WINDOWS\\\\system32\\\\[a-z]{5,7}.exe\" and registry.value==\"C:\\\\WINDOWS\\\\system32\\\\[a-z]{5,7}.exe\" and winlog.event_data.RegDetails==\"[A-Za-z]*\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d614692-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "urelas", "tags": [], "interval": "5m", "enabled": true, "description": "urelas", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6146ec-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[registry where event.code == \"13\" and registry.path==\"HKEY_LOCAL_MACHINE\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\FileAssociation\\\\C:\\\\WINDOWS\\\\system32\\\\[a-z]{5,7}.exe\" and registry.value==\"C:\\\\WINDOWS\\\\system32\\\\[a-z]{5,7}.exe\" and winlog.event_data.RegDetails==\"[A-Za-z]*\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d614958-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "urelas", "tags": [], "interval": "5m", "enabled": true, "description": "urelas", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6149c6-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"11\" && file.path:\"C:\\\\Documents and Settings\\\\<USER>\\\\Local Settings\\\\Temp\\\\[a-z]{6}.exe\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d614d5e-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "mira", "tags": [], "interval": "5m", "enabled": true, "description": "mira", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d614dc2-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Documents and Settings\\\\All Users\\\\Application Data\\\\Saaaalamm\\\\Mira.h\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"<FILE> .exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d614f98-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "mira", "tags": [], "interval": "5m", "enabled": true, "description": "mira", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d61509c-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": "", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d615470-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ulises", "tags": [], "interval": "5m", "enabled": true, "description": "ulises", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6154f2-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"13\" && registry.path:\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\CSRLT.EXE\" && registry.value:\"CSRLT.EXE\" && winlog.event_data.RegDetails:\"C:\\\\WINDOWS\\\\system32\\\\CSRLT.EXE\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6157fe-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "sfone", "tags": [], "interval": "5m", "enabled": true, "description": "sfone", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d615858-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"\\\\\\\\.\\\\VBoxMiniRdrDN\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Documents and Settings\\\\<USER>\\\\Local Settings\\\\Temp\\\\.*.exe\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d615a24-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "sfone", "tags": [], "interval": "5m", "enabled": true, "description": "sfone", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d615a7e-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[file where event.code == \"11\" and file.path==\"C:\\\\Documents and Settings\\\\<USER>\\\\Local Settings\\\\Temp\\\\.*.exe\"] by winlog.event_data.TopProcessGuid\r\n[file where event.code == \"11\" and file.path==\"\\\\\\\\VBOXSVR\\\\BEH0[0-9]{2}\\\\screensaver.scr\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d615c36-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "sfone", "tags": [], "interval": "5m", "enabled": true, "description": "sfone", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d615cae-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": "", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d616000-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "chapak", "tags": [], "interval": "5m", "enabled": true, "description": "chapak", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d616078-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"13\" && registry.path:\"HKEY_CURRENT_USER\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\[a-z]{11}\" && registry.value:\"[a-z]{11}\" && winlog.event_data.RegDetails:\"C:\\\\Documents and Settings\\\\<USER>\\\\Application Data\\\\Microsoft\\\\[a-z]{6}.exe\"\"\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6166f4-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "shiz", "tags": [], "interval": "5m", "enabled": true, "description": "shiz", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d6167c6-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "eql", "language": "eql", "index": ["winlogbeat-*"], "query": "sequence\r\n[process where event.code == \"1\" and process.executable==\"C:\\\\WINDOWS\\\\system32\\\\attrib.exe\" and process.command_line:\"attrib -r -s -h <FILE>\"\"\"] by winlog.event_data.TopProcessGuid", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d616cd0-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "shiz", "tags": [], "interval": "5m", "enabled": true, "description": "shiz", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d616d48-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"11\" && file.path:\"C:\\\\Documents and Settings\\\\<USER>\\\\Local Settings\\\\Temp\\\\2d17e659d34601689591\" ) || ( event.code:\"13\" && registry.path:\"HKEY_LOCAL_MACHINE\\\\software\\\\microsoft\\\\windows nt\\\\currentversion\\\\winlogon\\\\6c78a9c3\" && registry.value:\"6c78a9c3\" && winlog.event_data.RegDetails:\"\\\\xc7\\\\x80J]\\\\xfd%\\\\x86\\\\xcc[\\\\xaf\\\\x12\\\\xf42\\\\x1d\\\\x0e\\\\x8bq\\\\xbe\\\\x14q\\\\xba\\\\xd9\\\\xdd\\\\xb1\\\\>\\\\x82x\\\\xa4\\\\x10\\\\xf5\\\\xd3c\\\\xa4Z:V\\\\xed\\\\xcd\\\\x8d\\\\xe5\\\\xb5\\\\\\\\x95\\\\xba\\\\xbc\\\\xd3\\\\xdb\\\\x14\\\\xc5+\\\\x9d6E4\\\\xdc;\\\\xac\\\\x9c$3\\\\xa2j\\\\xe6\\\\xdd\\\\x8ee>\\\\xc5\" ) || ( event.code:\"1\" && process.executable:\"C:\\\\WINDOWS\\\\system32\\\\svchost.exe\" && process.command_line:\"C:\\\\Documents and Settings\\\\All Users\\\\Application Data\\\\[a-z0-9]{9,10}.exe\" ) || ( event.code:\"23\" && file.path:\"C:\\\\Documents and Settings\\\\<USER>\\\\Application Data\\\\[A-Za-z0-9]{6,7}.tmp.bat\" ) || ( event.code:\"11\" && file.path:\"<FILE>\" ) || ( event.code:\"11\" && file.path:\"C:\\\\Documents and Settings\\\\<USER>\\\\Application Data\\\\[A-Za-z0-9]{6,7}.tmp.bat\" ) || ( event.code:\"23\" && file.path:\"C:\\\\Documents and Settings\\\\All Users\\\\Application Data\\\\[A-Za-z0-9]{6,7}.tmp.bat\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"id": "5d6172e8-3da9-11ee-b72e-00155d01e997", "updated_at": "2022-03-21T16:08:29.816Z", "updated_by": "elastic", "created_at": "2022-03-21T16:08:27.788Z", "created_by": "elastic", "name": "ganelp", "tags": [], "interval": "5m", "enabled": true, "description": "ganelp", "risk_score": 21, "severity": "low", "license": "", "output_index": ".siem-signals-default", "meta": {"from": "1m", "kibana_siem_app_url": "http://192.168.198.3:5601/app/security"}, "author": [], "false_positives": [], "from": "now-360s", "rule_id": "5d61736a-3da9-11ee-b72e-00155d01e997", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "type": "query", "language": "lucene", "index": ["winlogbeat-*"], "query": " ( event.code:\"13\" && registry.path:\"HKEY_LOCAL_MACHINE\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\FileAssociation\\\\C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && registry.value:\"C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && winlog.event_data.RegDetails:\"jusched\" ) || ( event.code:\"13\" && registry.path:\"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\SharedAccess\\\\Parameters\\\\FirewallPolicy\\\\StandardProfile\\\\AuthorizedApplications\\\\List\\\\C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && registry.value:\"C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && winlog.event_data.RegDetails:\"C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe:*:Enabled:JavaUpdate23\" ) || ( event.code:\"13\" && registry.path:\"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\SharedAccess\\\\Parameters\\\\FirewallPolicy\\\\StandardProfile\\\\AuthorizedApplications\\\\List\\\\C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && registry.value:\"C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe\" && winlog.event_data.RegDetails:\"C:\\\\Program Files\\\\6c78a9fa\\\\jusched.exe:*:Enabled:edaJ2aUa3tpv\" ) ", "filters": [], "throttle": "no_actions", "actions": []}
{"exported_count": 24, "exported_rules_count": 24, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0}